In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name":['harry','rohan','skillf','shubh'],
    "marks" : [92,34,24,17],
    "city" : ['rampur','kolkata','bareily','antarctica']
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

     name  marks        city
0   harry     92      rampur
1   rohan     34     kolkata
2  skillf     24     bareily
3   shubh     17  antarctica

In [5]:
df.head(2)

    name  marks     city
0  harry     92   rampur
1  rohan     34  kolkata

In [6]:
df.tail(3)

     name  marks        city
1   rohan     34     kolkata
2  skillf     24     bareily
3   shubh     17  antarctica

In [7]:
df.describe()

          marks
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000

In [8]:
ser = pd.Series(np.random.rand(34))

In [9]:
ser

0     0.172291
1     0.892636
2     0.449182
3     0.632336
4     0.654832
5     0.803870
6     0.637026
7     0.322634
8     0.568407
9     0.771409
10    0.954961
11    0.334819
12    0.797335
13    0.535386
14    0.306129
15    0.654944
16    0.391070
17    0.756501
18    0.253836
19    0.976073
20    0.982477
21    0.694060
22    0.631616
23    0.971462
24    0.758477
25    0.233617
26    0.190320
27    0.044333
28    0.365424
29    0.533190
30    0.219141
31    0.025430
32    0.197423
33    0.907765
dtype: float64

In [10]:
type(ser)

pandas.core.series.Series

In [11]:
newdf = pd.DataFrame(np.random.rand(334,5), index=np.arange(334))

In [12]:
newdf

            0         1         2         3         4
0    0.338461  0.793746  0.101749  0.186702  0.439606
1    0.741713  0.537208  0.440438  0.371844  0.006269
2    0.101985  0.415849  0.314053  0.865430  0.701579
3    0.271698  0.360213  0.515918  0.668638  0.783571
4    0.653062  0.070667  0.202476  0.621895  0.536560
..        ...       ...       ...       ...       ...
329  0.905638  0.409533  0.374882  0.209380  0.000461
330  0.860111  0.798523  0.115985  0.741180  0.946149
331  0.081604  0.343062  0.741529  0.260209  0.864721
332  0.684520  0.650629  0.037702  0.118001  0.231201
333  0.101361  0.808685  0.597857  0.561133  0.518611

[334 rows x 5 columns]

In [13]:
type(newdf)

pandas.core.frame.DataFrame

In [14]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.488111    0.515434    0.491494    0.491529    0.513687
std      0.274563    0.284783    0.301572    0.294289    0.296439
min      0.000711    0.003193    0.000429    0.002689    0.000461
25%      0.270501    0.267959    0.227708    0.220198    0.249436
50%      0.491082    0.530229    0.483150    0.485179    0.518741
75%      0.718365    0.775156    0.742800    0.747082    0.771999
max      0.994177    0.998211    0.999754    0.999550    0.999092

In [15]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [16]:
newdf[0][0] = "harry"

C:\Users\welcome\AppData\Local\Temp\ipykernel_5332\2771891818.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf[0][0] = "harry"
C:\Users\welcome\AppData\Local\Temp\ipykernel_5332\2771891818.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'harry' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  newdf[0][0] = "harry"

In [17]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [18]:
newdf.head()

          0         1         2         3         4
0     harry  0.793746  0.101749  0.186702  0.439606
1  0.741713  0.537208  0.440438  0.371844  0.006269
2  0.101985  0.415849  0.314053  0.865430  0.701579
3  0.271698  0.360213  0.515918  0.668638  0.783571
4  0.653062  0.070667  0.202476  0.621895  0.536560

In [19]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int32', length=334)

In [20]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [21]:
newdf.to_numpy()

array([['harry', 0.7937458907776215, 0.10174949915606646,
        0.1867016844288849, 0.43960580566881835],
       [0.7417130079199334, 0.5372083438398579, 0.4404380824735544,
        0.371844256566748, 0.006269054534548624],
       [0.10198498262278777, 0.41584886293492773, 0.3140533663609669,
        0.8654303430522755, 0.7015786844085244],
       ...,
       [0.08160424662848442, 0.34306182269117147, 0.7415289640311855,
        0.2602092133595689, 0.864721367086015],
       [0.6845197323628093, 0.6506294407397982, 0.03770158991182315,
        0.11800083570447761, 0.23120119085096535],
       [0.10136132518780183, 0.8086845754830446, 0.5978565812957074,
        0.5611325229231336, 0.518611399369549]], dtype=object)

In [22]:
newdf.T
# T is used for transpose, changing row into columns and vice versa.

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,harry,0.741713,0.101985,0.271698,0.653062,0.854062,0.216871,0.346533,0.503725,0.511755,...,0.548673,0.295864,0.922691,0.603309,0.060378,0.905638,0.860111,0.081604,0.68452,0.101361
1,0.793746,0.537208,0.415849,0.360213,0.070667,0.645684,0.509709,0.553615,0.668694,0.67264,...,0.759476,0.551524,0.546842,0.591461,0.747739,0.409533,0.798523,0.343062,0.650629,0.808685
2,0.101749,0.440438,0.314053,0.515918,0.202476,0.408051,0.377498,0.869668,0.160307,0.571267,...,0.200958,0.896049,0.890188,0.324092,0.84104,0.374882,0.115985,0.741529,0.037702,0.597857
3,0.186702,0.371844,0.86543,0.668638,0.621895,0.674329,0.109497,0.220158,0.025358,0.23521,...,0.377271,0.354595,0.062269,0.063509,0.382962,0.20938,0.74118,0.260209,0.118001,0.561133
4,0.439606,0.006269,0.701579,0.783571,0.53656,0.40636,0.922522,0.510304,0.73438,0.518871,...,0.575403,0.111259,0.753754,0.364437,0.408472,0.000461,0.946149,0.864721,0.231201,0.518611

In [23]:
newdf.head()

          0         1         2         3         4
0     harry  0.793746  0.101749  0.186702  0.439606
1  0.741713  0.537208  0.440438  0.371844  0.006269
2  0.101985  0.415849  0.314053  0.865430  0.701579
3  0.271698  0.360213  0.515918  0.668638  0.783571
4  0.653062  0.070667  0.202476  0.621895  0.536560

In [24]:
newdf.loc[0,0] = 654

In [25]:
newdf.head(2)

          0         1         2         3         4
0       654  0.793746  0.101749  0.186702  0.439606
1  0.741713  0.537208  0.440438  0.371844  0.006269

In [28]:
newdf.loc[[1,2],[1,2]]

          1         2
1  0.537208  0.440438
2  0.415849  0.314053